In [3]:
(lambda x, y, z: x+y+z)(3,2,5)

10

In [4]:
import pandas as pd

# creating dataframe
dataframe = pd.DataFrame({'Name':['Shobhit','vaibhav',
                                'vimal','Sourabh'],
                        
                        'Class':[11,12,10,9],
                        'Age':[18,20,21,17]})

# Checking created dataframe
display(dataframe)

      Name  Class  Age
0  Shobhit     11   18
1  vaibhav     12   20
2    vimal     10   21
3  Sourabh      9   17

In [5]:
# without using inplace renaming the column
new_data = dataframe.rename(columns = {'Name':'FirstName'})

# check new_data
display(new_data)

  FirstName  Class  Age
0   Shobhit     11   18
1   vaibhav     12   20
2     vimal     10   21
3   Sourabh      9   17